САС/src/InformationRegisters/ДанныеОбъектовСопровождения/ДанныеОбъектовСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОбъектовСопровождения</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС/src/InformationRegisters/ДанныеОбъектовСопровождения/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'; en = 'Select file'");
   	ПараметрыДиалога.Фильтр = НСтр("ru = 'Текстовый файл'; en = 'Text file'") + " (*.xml)|*.xml|";
	
	НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ЗагрузитьСДискаЗавершение", ЭтотОбъект),,,,ПараметрыДиалога, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСДискаЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФайлКорректный(ОписаниеПомещенногоФайла.Адрес) Тогда
		ТекстСообщения = НСтр("ru = 'Файл пустой'; en = 'File is empty'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить(); 
		
		// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запись.ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
	Запись.РазмерФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Размер();
	АдресФайла = ОписаниеПомещенногоФайла.Адрес;
	
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ФайлКорректный(АдресФайлаВоВременномХранилище)

	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	
	ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	Если ТипЗнч(ДанныеИзХранилища) = Тип("ДвоичныеДанные") Тогда
		ДанныеИзХранилища.Записать(ПутьКФайлу);
	КонецЕсли;
	
	// Проверка на то что файл корректный
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ПутьКФайлу);
	Текст = ЧтениеТекста.Прочитать();
	
	Возврат ЗначениеЗаполнено(Текст);
	
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
	ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ИмяФайла) Тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.ИмяФайла) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстВопроса = НСтр("ru = 'Удалить файл?'; en = 'Delete file?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьФайлЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		АдресФайла = "";
		Запись.ИмяФайла = "";
		Запись.РазмерФайла = 0;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкачатьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаДляСкачивания = АдресФайла;
	
	Если Не ЭтоАдресВременногоХранилища(АдресФайлаДляСкачивания) Тогда
		АдресФайлаДляСкачивания = ПолучитьАдресФайлаДляСкачивания();
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаДляСкачивания) Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите путь для сохранения файла'; en = 'Select the path to save the file'");
		
		НачатьПолучениеФайлаССервера(АдресФайлаДляСкачивания, Запись.ИмяФайла, ПараметрыДиалога);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаКоманды = АдресФайла;
	
	Если Не ЭтоАдресВременногоХранилища(СтрокаКоманды) Тогда
		СтрокаКоманды = СтрокаКомандыИзХранилища(Запись.ИсходныйКлючЗаписи);
	Иначе
		СтрокаКоманды = СтрокаКомандыИзАдреса(АдресФайла);		
	КонецЕсли;
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды);
	
КонецПроцедуры 

Процедура Оповещение(КодВозврата, ДопПараметры) Экспорт

	

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайлаДляСкачивания()

	МенеджерЗаписи = РегистрыСведений.ДанныеОбъектовСопровождения.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись.ИсходныйКлючЗаписи);
	МенеджерЗаписи.Прочитать();
	
	АдресДляСкачивания = Неопределено;
	
	Если МенеджерЗаписи.Выбран() Тогда
		ДанныеФайла = МенеджерЗаписи.Файл.Получить();
		Если ДанныеФайла <> Неопределено Тогда
			АдресДляСкачивания = ПоместитьВоВременноеХранилище(ДанныеФайла);
		КонецЕсли;
	КонецЕсли;
	
	Возврат АдресДляСкачивания;

КонецФункции 

&НаСервереБезКонтекста
Функция СтрокаКомандыИзХранилища(ИсходныйКлючЗаписи) 
	
	МенеджерЗаписи = РегистрыСведений.ДанныеОбъектовСопровождения.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИсходныйКлючЗаписи);
	МенеджерЗаписи.Прочитать();
	
	СтрокаКоманды = "";
	
	Если МенеджерЗаписи.Выбран() Тогда
		ДанныеФайла = МенеджерЗаписи.Файл.Получить();
		ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
		ДанныеФайла.Записать(ВременныйФайл);
		
		Файл = Новый Файл(ВременныйФайл);
		
		Если Файл.Существует() Тогда		
			СтрокаКоманды = ВременныйФайл;	
		КонецЕсли;
	КонецЕсли;
		
	Возврат СтрокаКоманды;
	
КонецФункции 

&НаСервереБезКонтекста
Функция СтрокаКомандыИзАдреса(Адрес)
	
	СтрокаКоманды = "";
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
	ДанныеФайла.Записать(ВременныйФайл);
	
	Файл = Новый Файл(ВременныйФайл);
	
	Если Файл.Существует() Тогда		
		СтрокаКоманды = ВременныйФайл;	
	КонецЕсли;
	
	Возврат СтрокаКоманды;
	
КонецФункции
